// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

//6 -> да
//7 -> да
//1 -> нет

Console.Clear();
Console.WriteLine($"Ввести день от 1 до 7");
int num = int.Parse(Console.ReadLine());
 
 if (1 >= num )
{
        Console.WriteLine($"вых");
}
while( 2 > num );
{
    Console.WriteLine($"раб");
}
 return;
  
  if (3 >= num )
{
        Console.WriteLine($"вых");
}
while( 0 < num );
{
    Console.WriteLine($"раб");
}
 return;
 
  if (4 >= num )
{
        Console.WriteLine($"вых");
}
while( 0 < num );
{
    Console.WriteLine($"раб");
}
 return; 
 
 if ( 5 >= num )
{
        Console.WriteLine($"вых");
}
while( 0 < num );
{
    Console.WriteLine($"раб");
}
 return; 
 
if (6 <= num )
{
        Console.WriteLine($"вых");
}
while ( 0 < num) 
{
    Console.WriteLine($"раб");
}
 return;
 if (7 >= num )
{
        Console.WriteLine($"вых");
}
while( 0 < num );
{
    Console.WriteLine($"раб");
}
 return;